{
  "my-third-post": "After two and a half years as a Backend Developer at the Department of Physics, Arizona State University, I'm writing this with mixed feelings. On one hand, I'm excited for what's next. On the other hand, I'm going to really miss my office. Like, really miss it.\n\n## The Beginning\n\nWhen I joined in April 2023, I walked in thinking I'd just write some code and call it a day. Little did I know I'd end up building systems that would make me feel like I was running a small tech startup within a physics department. The irony of a backend developer working in a place where people study the fundamental forces of the universe wasn't lost on me.\n\n## Building the Space/Asset Management System\n\nOne of my major accomplishments was building and deploying a comprehensive space/asset management system. This wasn't just another project, it was my baby. I spent more time with this system than I did with some of my actual relationships (don't judge, the system never ghosted me).\n\n### Technical Stack (The Usual Suspects)\n- **Backend**: Node.js with Express.js (because why make life complicated?)\n- **Database**: SQL for structured data, MongoDB for when I wanted to feel rebellious\n- **Infrastructure**: AWS EC2 (because \"it works on my machine\" wasn't going to cut it)\n- **Frontend**: Figma for design, TypeScript for implementation (because JavaScript errors at 2 AM are not my idea of fun)\n\n### Impact\n\nThe system streamlined operations across the department, saving over $10,000 annually. But more importantly, it saved me from having to explain to my boss why the old system crashed every time someone tried to book a room. Now I just get to explain why my new system is \"down for maintenance\" (read: I broke something again).\n\n## RESTful API Development\n\nI created a suite of RESTful APIs using Express.js on a secure MongoDB backend. These APIs became the backbone for:\n\n- Streamlined reporting workflows (no more Excel spreadsheets that look like they were made in 1995)\n- Automated administrative processes (because humans make mistakes, but my code makes... different mistakes)\n- Real-time data synchronization (because waiting 5 minutes for data to update is so 2022)\n\nThis work cut manual administrative work by 40%. The staff was thrilled. I was thrilled. The coffee machine in the break room? Still indifferent, but that's okay.\n\n## Lessons Learned (The Hard Way)\n\n### Design First\nWorking with Figma taught me that spending 3 hours designing something that looks good is way better than spending 30 hours debugging something that looks like it was designed by a sleep-deprived developer (which, to be fair, it probably was).\n\n### TypeScript's Power\nTypeScript became my go-to language. Its type safety caught errors early, which meant fewer 2 AM debugging sessions and more time to actually sleep. Revolutionary concept, I know.\n\n### Full-Stack Thinking\nWhile my title was \"Backend Developer,\" I learned to think across the entire stack. Turns out, understanding how frontend and backend interact makes you a better developer. Who would've thought?\n\n## The Team (The Real MVPs)\n\nThe Department of Physics had an amazing team. Working alongside researchers who could explain quantum mechanics but couldn't figure out why their printer wasn't working taught me patience. Working with administrators who could organize a department but couldn't organize their browser tabs taught me... well, also patience.\n\n## What I'll Miss Most\n\nI'm going to really miss my office. That little space where I spent countless hours debugging, coding, and occasionally staring at the wall wondering why my code worked yesterday but doesn't work today. The office where I had my perfect setup, my favorite chair (yes, I had a favorite chair), and where I could focus without distractions.\n\nI'll miss the routine of walking in every morning, the familiar hum of the computers, and the satisfaction of solving problems that actually mattered. I'll miss the whiteboard where I sketched out system architectures and the window that gave me a view of... well, mostly the parking lot, but it was my parking lot view.\n\n## Moving Forward\n\nAs I say goodbye to this chapter, I'm grateful for:\n\n- The opportunity to build systems that made a real difference (and occasionally broke in spectacular ways)\n- The mentorship and support from my colleagues (who put up with my terrible jokes)\n- The technical challenges that pushed me to grow (and occasionally made me question my life choices)\n- The experience of working in an academic environment (where \"it's for research\" is a valid excuse for almost anything)\n- **My office** (seriously, I'm going to miss it so much)\n\nThis experience has prepared me well for the next phase of my career. The skills I developed here, from system architecture to API design to explaining to non-technical people why \"it's just a simple fix\" is never actually simple, will stay with me.\n\nThank you, Department of Physics, for an incredible journey. Thank you for the challenges, the growth, and most importantly, thank you for my office. Here's to the next adventure (and hopefully a new office that's just as good)!"
}


